# Bash 内建命令

# ############################################################################ #
#                                     Print                                    #
# ############################################################################ #

# =================================== echo =================================== #

# 输出字符串 -- Bash 内建命令
echo [-en] "string"

-e # 是否处理转义字符
-n # 不在行尾输出换行符，echo 默认在行尾输出换行符

# ================================== printf ================================== #

# 格式化输出字符串 -- Bash 内建命令
# 格式化为数字时，对于单引号或双引号开头的字符，输出其 ASCII 码
# 当无法作为数字输出时，报错

printf [-var var_name] "format" args...

-var varname # 输出到变量

# 输出类型
"%d, %i" # 有符号十进制
"%o"     # 无符号八进制
"%u"     # 无符号十进制
"%X, %x" # 无符号十六进制
"%f, %F" # 有符号浮点数
"%e, %E" # 科学计数
"%g, %G" # 采用浮点数 f 或科学计数 e，保证使用空间最小
"%a, %A" # 十六进制的科学计数
"%c"     # 第一个字符
"%s"     # 字符串
"%%"     # 百分号

# 格式化参数
0     # padding 0
-     # 左对齐，覆盖 0
space # 正数前带空格
+     # 正数带加号，覆盖空格
5.3   # 	宽度 5 精度 3

# 实例
printf "%10d" '"a'    # 打印字符 A 的 ASCII 码，宽度为 10
printf "%.2f" 3.1415  # 打印精度为 2 的浮点数
printf "%.0f" 3.14    # 省略浮点数的小数位
printf "%05d" 1       # 宽度为 5，不足补 0
printf "%x" 1024      # 打印 16 进制
printf "%10s" abc     # 打印宽度为 10 的字符串
printf "%-10s" abc    # 打印宽度为 10 的字符串，左对齐显示
printf "123" -var aaa # 输出 123 到变量 aaa 中

# ############################################################################ #
#                                Config Options                                #
# ############################################################################ #

# =================================== shopt ================================== #

# shopt 设置 shell 选项
shopt        # 打印所有配置
shopt -p     # 同上
shopt -o opt # 修改使用 set -o 指定的配置
shopt -s opt # 打开配置
shopt -u opt # 关闭配置
shopt -q opt # 判断某个配置是否打开

dotglob    # 文件扩展的时候匹配 . 开头的隐藏文件
nullglob   # 文件扩展的时候，如果没有匹配到文件，则扩展为空字符串
failglob   # 文件扩展的时候，如果没有匹配到文件，则报错
nocaseglob # 文件扩展的时候忽略大小写

# ==================================== set =================================== #

# set 设置 shell 变量和特性
# TODO
